# コメントとかじゃなくて普通にメモ
# brew bundle dump --global
# mv ~/.Brewfile ./

tap "homebrew/services"
tap "koekeishiya/formulae"
tap "nikitabobko/tap"
brew "awscli"
brew "bat"
brew "displayplacer"
brew "fd"
brew "fzf"
brew "ghq"
brew "git-delta"
brew "go"
brew "peco"
brew "yazi"
brew "colordiff"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
vscode "aaron-bond.better-comments"
vscode "bradlc.vscode-tailwindcss"
vscode "esbenp.prettier-vscode"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-ja"
vscode "ms-vscode-remote.remote-containers"
vscode "naumovs.color-highlight"
vscode "oderwat.indent-rainbow"
vscode "openai.chatgpt"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "tamasfe.even-better-toml"
vscode "vscodevim.vim"
go "github.com/spf13/cobra-cli"
go "golang.org/x/tools/gopls"
go "honnef.co/go/tools/cmd/staticcheck"
